In [1]:
import pandas as pd
import datetime as dt

In [2]:
txt = pd.read_excel(r'D:\Full Satck Data Science & AI\New folder\convert raw data - clean data.xlsx')

In [3]:
txt

,Unnamed: 0,Unnamed: 1,ADDR,DT,NAME,time
0,NaN,NaN,"45 rd, kenith street, btm, bangalore,500038",2022-04-03,abc,8:30:21
1,NaN,NaN,"45 rd, street, hitech, Hd,500038",2022-04-02,dec,5:30:21

In [4]:
txt = txt.drop(columns=['Unnamed: 0','Unnamed: 1'], axis=1)

In [5]:
txt

                                          ADDR         DT NAME     time
0  45 rd, kenith street, btm, bangalore,500038 2022-04-03  abc  8:30:21
1            45 rd,  street, hitech, Hd,500038 2022-04-02  dec  5:30:21

In [6]:
txt.shape

(2, 4)

In [7]:
addr_split = txt["ADDR"].str.split(",", expand = True)

In [8]:
addr_split

       0               1        2           3       4
0  45 rd   kenith street      btm   bangalore  500038
1  45 rd          street   hitech          Hd  500038

In [9]:
txt['House Add']=addr_split[0]
txt['Street']=addr_split[1]
txt['City']=addr_split[2]
txt['state']=addr_split[3]
txt['zip']=addr_split[4]

In [10]:
txt

,ADDR,DT,NAME,time,House Add,Street,City,state,zip
0,"45 rd, kenith street, btm, bangalore,500038",2022-04-03,abc,8:30:21,45 rd,kenith street,btm,bangalore,500038
1,"45 rd, street, hitech, Hd,500038",2022-04-02,dec,5:30:21,45 rd,street,hitech,Hd,500038

In [11]:
del txt['ADDR']

In [12]:
txt

,DT,NAME,time,House Add,Street,City,state,zip
0,2022-04-03,abc,8:30:21,45 rd,kenith street,btm,bangalore,500038
1,2022-04-02,dec,5:30:21,45 rd,street,hitech,Hd,500038

In [13]:
txt['Year']=pd.to_datetime(txt['DT']).dt.year
txt['Month']=pd.to_datetime(txt['DT']).dt.month
txt['Day']=pd.to_datetime(txt['DT']).dt.day
txt['Hour']=pd.to_datetime(txt['time']).dt.hour
txt['Minute']=pd.to_datetime(txt['time']).dt.minute
txt['Second']=pd.to_datetime(txt['time']).dt.second

In [14]:
txt

,DT,NAME,time,House Add,Street,City,state,zip,Year,Month,Day,Hour,Minute,Second
0,2022-04-03,abc,8:30:21,45 rd,kenith street,btm,bangalore,500038,2022,4,3,8,30,21
1,2022-04-02,dec,5:30:21,45 rd,street,hitech,Hd,500038,2022,4,2,5,30,21

In [15]:
del txt['DT']

In [16]:
txt

,NAME,time,House Add,Street,City,state,zip,Year,Month,Day,Hour,Minute,Second
0,abc,8:30:21,45 rd,kenith street,btm,bangalore,500038,2022,4,3,8,30,21
1,dec,5:30:21,45 rd,street,hitech,Hd,500038,2022,4,2,5,30,21

In [17]:
del txt['time']

In [18]:
txt

,NAME,House Add,Street,City,state,zip,Year,Month,Day,Hour,Minute,Second
0,abc,45 rd,kenith street,btm,bangalore,500038,2022,4,3,8,30,21
1,dec,45 rd,street,hitech,Hd,500038,2022,4,2,5,30,21